app/controllers/home_controller.rb

	def index
		@all_patients = Patient.all
		@all_doctors = Doctor.all
		@all_appointments = Appointment.all
---
SELECT `patients`.* FROM `patients`
SELECT `doctors`.* FROM `doctors`
SELECT `appointments`.* FROM `appointments`

	def create_patient
		patient_details = JSON.parse(params["patient_details"])
		create_new_patient = Patient.create(
			:name => patient_details["name"],
			:phone => patient_details["number"]
		)
---
INSERT INTO `patients` (`name`, `phone`, `created_at`, `updated_at`) VALUES ('pat.1', 565776, '2018-06-30 15:28:56', '2018-06-30 15:28:56')

	def create_doctor
		doctor_details = JSON.parse(params["doctor_details"])
		create_new_doctor = Doctor.create(
			:name => doctor_details["name"],
			:phone => doctor_details["number"],
			:specialization => doctor_details["specialization"]
		)
---
INSERT INTO `doctors` (`name`, `phone`, `specialization`, `created_at`, `updated_at`) VALUES ('bhuvana', 5678, 'child', '2018-06-30 15:38:26', '2018-06-30 15:38:26')

	def create_appointment
		appointment_details = JSON.parse(params["appointment_details"])
		create_new_appointment = Appointment.create(
			:doctor_name => appointment_details["doctor_name"],
			:patient_name => appointment_details["patient_name"],
			:disease => appointment_details["disease"]
		)
---
INSERT INTO `appointments` (`doctor_name`, `patient_name`, `disease`, `created_at`, `updated_at`) VALUES ('bhuvana', 'lalala3', 'cold', '2018-06-30 16:43:28', '2018-06-30 16:43:28')